{
  "profile": {
    "name": "Yash Jariwala",
    "tagline": "Data Analyst | Business Reporting & Automation",
    "image": "assets/profile.jpg",
    "social": [
      { "icon": "fab fa-linkedin", "url": "https://www.linkedin.com/in/yash-jariwala-ai/" },
      { "icon": "fab fa-github", "url": "https://github.com/yashjariwala9" },
      { "icon": "fas fa-envelope", "url": "mailto:yashjariwala730@gmail.com" },
      { "icon": "fas fa-rss", "url": "https://yashjariwala.substack.com/" }
    ]
  },
  "about": "I'm a data analyst based in Surat, India. I spend most of my time working with messy financial and operational data — cleaning it, making sense of it, and turning it into reports and dashboards that people can actually use to make decisions.\n\nRight now I work with ERP systems like Tally and Odoo, build dashboards in Power BI, and write automation scripts in Python and Google Apps Script. A lot of my day-to-day involves figuring out why numbers don't match, building pipelines that save people from doing the same manual work every week, and explaining what the data means to people who aren't data people.\n\nI'm currently learning the fundamentals behind data science — statistics, linear algebra, machine learning algorithms — because I want to move beyond reporting and start building models that predict things, not just describe them.",
  "experience": [
    {
      "date": "Jun 2025 – Present",
      "role": "Data Analyst",
      "company": "Onewin Management Consultants India Pvt. Ltd.",
      "description": "- Work with a textile manufacturing client on their financial data — mainly sales reports, cash flow tracking, and trial balance analysis.\n- Clean and structure their raw financial data, then build Excel reports and Power BI dashboards so the management team can spot issues without digging through spreadsheets.\n- Built a dashboard to track employee working hours across the team — something they were doing manually before.\n- Connected Tally ERP directly to Power BI using ODBC so reports update without anyone having to export files manually.\n- Used Python and PostgreSQL to pull and organize data from Odoo ERP for reporting.\n- Set up automated data collection for a financial services client using Google Forms and Google Apps Script — multiple people were submitting data in different formats, so I consolidated everything into one sheet that updates automatically."
    }
  ],
  "projects": [
    {
      "title": "E-Commerce Data Analytics",
      "url": "https://github.com/yashjariwala9/e-commerce-data-analytics",
      "description": "I wanted to practice working with e-commerce data end to end, so I generated a realistic synthetic dataset using Python (Pandas and Faker) and built a full analytics solution on top of it.\n\nThe Power BI dashboard tracks the metrics that actually matter in e-commerce — revenue growth, gross margin, average order value, customer lifetime value, and return rates — all built with DAX measures.\n\nThe main focus was on making the insights useful: customer segmentation, sales trends, logistics performance, and workforce productivity are all covered in the dashboards."
    },
    {
      "title": "Supermarket Sales Analysis",
      "url": "https://github.com/yashjariwala9/sales-analysis-sql",
      "description": "This project was about getting comfortable with SQL for real analytical work, not just basic queries.\n\nI wrote a Python script to load the raw CSV and Excel data into PostgreSQL automatically, then worked through the analysis using CTEs and aggregate functions to find which products, regions, and customer segments were actually performing.\n\nThe output was a set of findings on order patterns, shipping times, and buying behavior — the kind of analysis that feeds into decisions about stock and logistics."
    }
  ],
  "education": "**Bachelor of Computer Applications** – Veer Narmad South Gujarat University, Surat, India (2022–2025)\n\nMajor: Computer Science"
}
